[{"eventName": "Anti-Valentine Films At The Projector", "eventCoord": [1.301947, 103.864015], "eventInfo": "Not a rose, satin heart or a bloody cupid in sight: you're safe at The Projector. Wallow in sorrow and catch an anti-Valentine's film here. On rotation for your bleeding heart: explore treacherous love triangles in Closer, spend 500 Days of Summer reminiscing shitty and legendary exes, and renounce marriage with Kramer vs Kramer. Ah, doesn't love suck?", "eventDate": "18 Feb"}, {"eventName": "Villa Fiesta", "eventCoord": [1.311345, 103.814981], "eventInfo": "Just because it's already Chinese New Year, it doesn't mean we're going to stop shopping! Gather at The Halia at the Singapore Botanic Gardens to shop from crafters, various designers and brands. And there's always brunch at The Halia to look forward to after your shopping rounds.", "eventDate": "17-18 Feb"}, {"eventName": "River Hongbao 2018", "eventCoord": [1.288153, 103.859028], "eventInfo": "This is possibly Singapore's most classic CNY event. Each year, thousands flock to this Chinese New Year display, which features mega-sized colourful lanterns, eclectic live performances and plenty of fireworks. Highlights include a Popular Food Street for scoffing local snacks, a \"My Home, My New Year\" exhibition that showcases how Chinese New Year is traditionally celebrated over the years, and for the kiddos: a fun amusement park filled with carnival games and rides.", "eventDate": "14-24 Feb"}, {"eventName": "Fortune Street", "eventCoord": [1.255179, 103.8218107], "eventInfo": "You know we like a bit of fortune telling here at Honeycombers. Usher in good fortune this weekend at Resorts World Sentosa with an exploratory journey of Eastern and Western divination. Thinking if your future plans are in line with the stars? Seek your advice from masters of nine different schools of divination, including astrology, Feng Shui, and Oracle card reading.", "eventDate": "16-25 Feb"}, {"eventName": "The House Is Crumbling", "eventCoord": [1.289704, 103.851285], "eventInfo": "On of the exhibits from the Light to Night Festival, The House Is Crumbling is a sculptural installation made up of 4,000 Thai Khit pillows, assembled into a combination of fixed structures and loose forms. Each pillow acts as a building block, with strings sewn into its sides that allow it to be freely detached and connected. The audience are invited to interact with the work, deconstructing and reconstructing it to redefine the environment within the exhibition space.", "eventDate": "until 1 Apr"}, {"eventName": "The Prudential Marina Bay Carnival", "eventCoord": [1.2834785, 103.859209], "eventInfo": "Singapore's \"biggest carnival\", The Prudential Marina Bay Carnival will occupy an area the size of three-and-a-half football fields. Expect rides galore (over 40 rides and games brought in from various European countries), indulgent festival grub, music and entertainment, and lots of fun. We already had our go at the carnival and boy, was it a whole lot of fun. Bring the whole fambam!", "eventDate": "Until 1 Apr 2018"}, {"eventName": "Stretch and Scratch", "eventCoord": [1.2815683, 103.8636132], "eventInfo": "It's bring your dog to yoga day! You know that we do love our dogs here in Honeycombers , Year of the Dog or not. Join in on this attempt to break the world record for 'Largest Dog Yoga Class'. All you have to do is bring your yoga mat and your dog buddy this weekend, and be part of this experience!", "eventDate": ""}, {"eventName": "Chocolate Truffles V'Day Workshop", "eventCoord": [1.3552245, 103.8876628], "eventInfo": "In 1861, Richard Cadbury created the first ever heart-shaped box for Valentine's Day. Thus, began the common link between chocolate and Valentine's Day. Create something as well for your loved ones this Valentine's weekend. Instead of purchasing chocolates off the shelf! The workshop will teach you how to temper dark chocolate to create a crisp outer layer, prepare dark chocolate ganache, make assorted fillings... basically all you need to know about making pretty chocolates.", "eventDate": "17-18 Feb"}, {"eventName": "Art From The Streets", "eventCoord": [1.2862738, 103.8592663], "eventInfo": "ArtScience Museum will be invaded by some of the world's top street artists in one of the boldest exhibitions to be shown at the museum. Art from the Streets traces 40 years of Street Art, from its countercultural beginnings to its extraordinary rise as a major phenomenon in contemporary art. The show features the world's best known street artists including Banksy, Shepard Fairey (aka Obey), Futura, Invader, JR, Blek le Rat, Swoon and Vhils among others. Art from the Streets reflects the evolution of street art, charting the diverse artistic techniques employed by artists through the decades and showing how technology has created new expressive avenues for artists. First, you can check out our wall crawl for street art around Singapore, and check out our full story on Art from the Streets to get a sneak peek of the exhibit.", "eventDate": "Until 3 Jun"}, {"eventName": "Night of Cheer Punk: 90s Boom Boom Party", "eventCoord": [1.301947, 103.864015], "eventInfo": "Usher in the year of the Dog with a feel-good 90s Boom Boom Party, on Chinese New Year! When you're done and dusted with the pineapple tarts, mahjong, house visits and kaypoh relatives this weekend, come indulge in nostalgic tunes and get jiggy with it. Dance and groove to best decade in history with DJ KRSTN spinning and end the night with a song dedication radio show style with DJ CHIIK3N.", "eventDate": "17 Feb"}, {"eventName": "Spring Surprise", "eventCoord": [1.2815683, 103.8636132], "eventInfo": "Meet the God of Fortune, join Chinese handicraft sessions, and keep an eye out this weekend for the ultraviolet light performances by UV Lotus Dragon and Northern Lions! And of course, no CNY festivity is complete without the majestic lion dance on poles, which you can catch at the Supertree Grove.", "eventDate": "14-25 Feb"}]